using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _003_DataBasePlayers
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Реализовать базу данных игроков и методы для работы с ней.
            // У игрока может быть уникальный номер, ник, уровень, флаг – забанен ли он(флаг - bool).
            // Реализовать возможность добавления игрока, бана игрока по уникальный номеру, разбана игрока по уникальный номеру и удаление игрока.
            // Создание самой БД не требуется, задание выполняется инструментами, которые вы уже изучили в рамках курса.Но нужен класс, который
            // содержит игроков и её можно назвать "База данных".
        }
    }
}
