using System;

namespace ArrayApp4
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //Пользователь вводит числа, и программа их запоминает.
            //Как только пользователь введёт команду sum, программа выведет сумму всех веденных чисел.
            //Выход из программы должен происходить только в том случае, если пользователь введет команду exit.
            //Если введено не sum и не exit, значит это число и его надо добавить в массив.
            //Программа должна работать на основе расширения массива.
            //Внимание, нельзя использовать List<T> и Array.Resize


        }
    }
}
