using System;

namespace _001_PersonnelAccounting
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //Будет 2 массива: 1) фио 2) должность.
            //Описать функцию заполнения массивов досье, функцию форматированного вывода, функцию поиска по фамилии и функцию удаления досье.
            //Функция расширяет уже имеющийся массив на 1 и дописывает туда новое значение.
            //Программа должна быть с меню, которое содержит пункты:
            //1) добавить досье
            //2) вывести все досье(в одну строку через “-” фио и должность с порядковым номером в начале)
            //3) удалить досье(Массивы уменьшаются на один элемент.Нужны дополнительные проверки, чтобы не возникало ошибок)
            //4) поиск по фамилии
            //5) выход
        }
    }
}
